Tekla Open API Reference for Tekla Structures 2025
View.SharedView Property
 The property which tells if the view is shared. The value is meaningful only when the model is shared.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SharedView { get; set; }
Public Property SharedView As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
View Class
Tekla.Structures.Model.UI Namespace